vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA346_DFP.pdsc
    <condition id="component.sgi_pkc.ffdh.condition_id">
      <require condition="allOf.device=MCXA346.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.flow_protection.condition_id">
      <require condition="allOf.device=MCXA346.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.glikey.condition_id">
      <require condition="allOf.component.sgi_pkc.pre_processor, device=MCXA346.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.pre_processor, device=MCXA346.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require condition="device.MCXA346.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.hash.condition_id">
      <require condition="allOf.component.sgi_pkc.session, device=MCXA346.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.session, device=MCXA346.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_session"/>
      <require condition="device.MCXA346.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.hashmodes.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, component.sgi_pkc.hash, device=MCXA346.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.buffer, component.sgi_pkc.hash, device=MCXA346.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_buffer"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_hash"/>
      <require condition="device.MCXA346.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.hmac.condition_id">
      <require condition="allOf.component.sgi_pkc.key, component.sgi_pkc.padding, component.sgi_pkc.toolchain, device=MCXA346.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.key, component.sgi_pkc.padding, component.sgi_pkc.toolchain, device=MCXA346.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_key"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_padding"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain"/>
      <require condition="device.MCXA346.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.key.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA346.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA346.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_buffer"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_memory"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require condition="device.MCXA346.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.mac.condition_id">
      <require condition="allOf.component.sgi_pkc.padding, component.sgi_pkc.toolchain, device=MCXA346.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.padding, component.sgi_pkc.toolchain, device=MCXA346.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_padding"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain"/>
      <require condition="device.MCXA346.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.mac_modes.condition_id">
      <require condition="allOf.component.sgi_pkc.mac, device=MCXA346.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.mac, device=MCXA346.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_mac"/>
      <require condition="device.MCXA346.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.math.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.pkc, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA346.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.pkc, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA346.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_buffer"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pkc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require condition="device.MCXA346.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.memory.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.param_integrity, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, component.sgi_pkc.toolchain, device=MCXA346.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.param_integrity, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, component.sgi_pkc.toolchain, device=MCXA346.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_param_integrity"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain"/>
      <require condition="device.MCXA346.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.padding.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, device=MCXA346.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.param_integrity.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA346.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA346.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require condition="device.MCXA346.internal_condition"/>
    </condition>
