vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA346_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_session" Cversion="1.0.0" condition="component.sgi_pkc.session.condition_id">
      <description>Component sgi_pkc.session</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSession/src/mcuxClSession.c" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSession/src/mcuxClSession_jobHandling.c" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSession/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src/size"/>
        <file category="sourceAsm" name="components/sgi_pkc/src/comps/mcuxClSession/src/asm/mcuxClSession_Internal_EntryExit_EarlyExit_Entry_arm.S" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src/asm"/>
        <file category="sourceAsm" name="components/sgi_pkc/src/comps/mcuxClSession/src/asm/mcuxClSession_Internal_EntryExit_EarlyExit_Return_arm.S" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src/asm"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/mcuxClSession.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_FeatureConfig.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit_EarlyExit.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit_EarlyExit_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSession/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_sgi_pkc" Cversion="1.0.0" condition="component.sgi_pkc.sgi_pkc.condition_id">
      <description>Component sgi_pkc</description>
      <files>
        <file category="doc" name="components/sgi_pkc/component.sgi_pkc.sgi_pkc_dummy.txt"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_signature" Cversion="1.0.0" condition="component.sgi_pkc.signature.condition_id">
      <description>Component sgi_pkc.signature</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSignature/src/mcuxClSignature.c" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSignature/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/internal/mcuxClSignature_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain" Cversion="1.0.0" condition="component.sgi_pkc.toolchain.condition_id">
      <description>Component sgi_pkc toolchain</description>
      <files>
        <file category="header" name="components/sgi_pkc/src/compiler/mcuxClToolchain.h" projectpath="component/sgi_pkc/src/compiler"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/compiler/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="component.timer_manager.condition_id">
      <description>Component timer_manager</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h" projectpath="component/timer_manager"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c" projectpath="component/timer_manager"/>
        <file category="include" name="components/timer_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA346_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXA346_cmsis</description>
      <files>
        <file category="header" name="devices/MCXA346/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXA346/MCXA346.h" projectpath="device"/>
        <file category="header" name="devices/MCXA346/MCXA346_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXA346/MCXA346_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_ADC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_AOI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_CAN.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_CDOG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_CMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_CRC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_CTIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_DEBUGMAILBOX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_DIGTMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_DMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_EIM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_EQDC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_ERM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_FLEXIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_FMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_FMU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_FREQME.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_GLIKEY.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_GPIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_I3C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_INPUTMUX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_LCD.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_LPCMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_LPDAC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_LPI2C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_LPSPI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_LPTMR.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_LPUART.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_MAU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_MRCC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_OPAMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_OSTIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_PKC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_PORT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_PWM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_RTC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_SCG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_SGI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_SMARTDMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_SPC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_SYSCON.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_TRDC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_TRNG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_UDF.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_USB.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_UTICK.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_VBAT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_WAKETIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_WUU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA346/periph2/PERI_WWDT.h" projectpath="device/periph2"/>
        <file category="include" name="devices/MCXA346/"/>
        <file category="include" name="devices/MCXA346/periph2/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA346/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA346/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXA346_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXA346_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA346.condition_id" category="linkerScript" name="devices/MCXA346/arm/MCXA346_flash.scf" projectpath="MCXA346/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA346.condition_id" category="linkerScript" name="devices/MCXA346/arm/MCXA346_ram.scf" projectpath="MCXA346/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA346.condition_id" category="linkerScript" name="devices/MCXA346/gcc/MCXA346_flash.ld" projectpath="MCXA346/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA346.condition_id" category="linkerScript" name="devices/MCXA346/gcc/MCXA346_ram.ld" projectpath="MCXA346/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA346.condition_id" category="linkerScript" name="devices/MCXA346/iar/MCXA346_flash.icf" projectpath="MCXA346/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA346.condition_id" category="linkerScript" name="devices/MCXA346/iar/MCXA346_ram.icf" projectpath="MCXA346/iar"/>
      </files>
    </component>
